# ДЗ 2, задача 8 «Превышение скорости в каршеринге» (★★☆)
# Главы: 2.4
#
# Сервис каршеринга удерживает с клиента штраф за превышение скорости. Превышение — разница между
# фактической и разрешённой скоростью. При превышении до 20 км/ч включительно штрафа нет, от 21 до
# 40 — 750 руб., от 41 до 60 — 1500 руб., от 61 до 80 — 2500 руб., больше 80 — 5000 руб. Вводятся
# разрешённая и фактическая скорость — целые числа. Выведите «Штраф: N руб.»
#
# Каждый input() выводит подсказку. Тексты подсказок — как в примерах, после двоеточия или скобки
# стоит пробел.
#
# Пример 1
#   ввод:
#     60
#     75
#   в терминале:
#     Разрешённая скорость, км/ч: 60
#     Фактическая скорость, км/ч: 75
#     Штраф: 0 руб.
# Пример 2
#   ввод:
#     60
#     100
#   в терминале:
#     Разрешённая скорость, км/ч: 60
#     Фактическая скорость, км/ч: 100
#     Штраф: 750 руб.
# Пример 3
#   ввод:
#     90
#     150
#   в терминале:
#     Разрешённая скорость, км/ч: 90
#     Фактическая скорость, км/ч: 150
#     Штраф: 1500 руб.
# Пример 4
#   ввод:
#     110
#     175
#   в терминале:
#     Разрешённая скорость, км/ч: 110
#     Фактическая скорость, км/ч: 175
#     Штраф: 2500 руб.
# Пример 5
#   ввод:
#     40
#     121
#   в терминале:
#     Разрешённая скорость, км/ч: 40
#     Фактическая скорость, км/ч: 121
#     Штраф: 5000 руб.

# Решение
razresheno=int(input("Разрешённая скорость, км/ч: "))
fact=int(input("Фактическая скорость, км/ч: "))
raznica=fact-razresheno
if raznica <= 20:
    print("Штраф: 0 руб.")
elif 21 <= raznica <= 40:
    print("Штраф: 750 руб.")
elif 41 <= raznica <= 60:
    print("Штраф: 1500 руб.")
elif 61 <= raznica <= 80:
    print("Штраф: 2500 руб.")
else:
    print("Штраф: 5000 руб.")