# ДЗ 2, задача 9 «Вид треугольника» (★★☆)
# Главы: 2.3, 2.4
#
# Вводятся длины трёх сторон треугольника — целые числа. Треугольник существует, если каждая
# сторона меньше суммы двух других. Выведите «Треугольник не существует», «Равносторонний»,
# «Равнобедренный» (равны ровно две стороны) или «Разносторонний».
#
# Каждый input() выводит подсказку. Тексты подсказок — как в примерах, после двоеточия или скобки
# стоит пробел.
#
# Пример 1
#   ввод:
#     3
#     4
#     5
#   в терминале:
#     Сторона a: 3
#     Сторона b: 4
#     Сторона c: 5
#     Разносторонний
# Пример 2
#   ввод:
#     5
#     5
#     5
#   в терминале:
#     Сторона a: 5
#     Сторона b: 5
#     Сторона c: 5
#     Равносторонний
# Пример 3
#   ввод:
#     5
#     8
#     5
#   в терминале:
#     Сторона a: 5
#     Сторона b: 8
#     Сторона c: 5
#     Равнобедренный
# Пример 4
#   ввод:
#     1
#     2
#     3
#   в терминале:
#     Сторона a: 1
#     Сторона b: 2
#     Сторона c: 3
#     Треугольник не существует

# Решение
a=int(input("Сторона a: "))
b=int(input("Сторона b: "))
c=int(input("Сторона c: "))
if (a > (c+b)) or (c > (a+b)) or (b > (c+a)):
    print("Треугольник не существует")
elif a == b == c:
    print("Равносторонний")
elif (a==b and a!=c) or (a==c and a!=b) or (b==c and b!=a):
    print("Равнобедренный")
elif a != b != c:
    print("Разносторонний")